{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Unknown Artist",
    "1": "boris-kustodiev",
    "10": "ivan-shishkin",
    "100": "orest-kiprensky",
    "101": "william-merritt-chase",
    "102": "aleksey-savrasov",
    "103": "hans-memling",
    "104": "amedeo-modigliani",
    "105": "ivan-kramskoy",
    "106": "utagawa-kuniyoshi",
    "107": "gustave-courbet",
    "108": "william-turner",
    "109": "theo-van-rysselberghe",
    "11": "john-singer-sargent",
    "110": "joseph-wright",
    "111": "edward-burne-jones",
    "112": "koloman-moser",
    "113": "viktor-vasnetsov",
    "114": "anthony-van-dyck",
    "115": "raoul-dufy",
    "116": "frans-hals",
    "117": "hans-holbein-the-younger",
    "118": "ilya-mashkov",
    "119": "henri-fantin-latour",
    "12": "marc-chagall",
    "120": "m.c.-escher",
    "121": "el-greco",
    "122": "mikalojus-ciurlionis",
    "123": "james-mcneill-whistler",
    "124": "karl-bryullov",
    "125": "jacob-jordaens",
    "126": "thomas-gainsborough",
    "127": "eugene-delacroix",
    "128": "canaletto",
    "13": "martiros-saryan",
    "14": "nicholas-roerich",
    "15": "pablo-picasso",
    "16": "paul-cezanne",
    "17": "pierre-auguste-renoir",
    "18": "pyotr-konchalovsky",
    "19": "raphael-kirchner",
    "2": "camille-pissarro",
    "20": "rembrandt",
    "21": "salvador-dali",
    "22": "vincent-van-gogh",
    "23": "hieronymus-bosch",
    "24": "leonardo-da-vinci",
    "25": "albrecht-durer",
    "26": "edouard-cortes",
    "27": "sam-francis",
    "28": "juan-gris",
    "29": "lucas-cranach-the-elder",
    "3": "childe-hassam",
    "30": "paul-gauguin",
    "31": "konstantin-makovsky",
    "32": "egon-schiele",
    "33": "thomas-eakins",
    "34": "gustave-moreau",
    "35": "francisco-goya",
    "36": "edvard-munch",
    "37": "henri-matisse",
    "38": "fra-angelico",
    "39": "maxime-maufra",
    "4": "claude-monet",
    "40": "jan-matejko",
    "41": "mstislav-dobuzhinsky",
    "42": "alfred-sisley",
    "43": "mary-cassatt",
    "44": "gustave-loiseau",
    "45": "fernando-botero",
    "46": "zinaida-serebriakova",
    "47": "georges-seurat",
    "48": "isaac-levitan",
    "49": "joaqu\u00e3\u00adn-sorolla",
    "5": "edgar-degas",
    "50": "jacek-malczewski",
    "51": "berthe-morisot",
    "52": "andy-warhol",
    "53": "arkhip-kuindzhi",
    "54": "niko-pirosmani",
    "55": "james-tissot",
    "56": "vasily-polenov",
    "57": "valentin-serov",
    "58": "pietro-perugino",
    "59": "pierre-bonnard",
    "6": "eugene-boudin",
    "60": "ferdinand-hodler",
    "61": "bartolome-esteban-murillo",
    "62": "giovanni-boldini",
    "63": "henri-martin",
    "64": "gustav-klimt",
    "65": "vasily-perov",
    "66": "odilon-redon",
    "67": "tintoretto",
    "68": "gene-davis",
    "69": "raphael",
    "7": "gustave-dore",
    "70": "john-henry-twachtman",
    "71": "henri-de-toulouse-lautrec",
    "72": "antoine-blanchard",
    "73": "david-burliuk",
    "74": "camille-corot",
    "75": "konstantin-korovin",
    "76": "ivan-bilibin",
    "77": "titian",
    "78": "maurice-prendergast",
    "79": "edouard-manet",
    "8": "ilya-repin",
    "80": "peter-paul-rubens",
    "81": "aubrey-beardsley",
    "82": "paolo-veronese",
    "83": "joshua-reynolds",
    "84": "kuzma-petrov-vodkin",
    "85": "gustave-caillebotte",
    "86": "lucian-freud",
    "87": "michelangelo",
    "88": "dante-gabriel-rossetti",
    "89": "felix-vallotton",
    "9": "ivan-aivazovsky",
    "90": "nikolay-bogdanov-belsky",
    "91": "georges-braque",
    "92": "vasily-surikov",
    "93": "fernand-leger",
    "94": "konstantin-somov",
    "95": "katsushika-hokusai",
    "96": "sir-lawrence-alma-tadema",
    "97": "vasily-vereshchagin",
    "98": "ernst-ludwig-kirchner",
    "99": "mikhail-vrubel"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Unknown Artist": "0",
    "albrecht-durer": "25",
    "aleksey-savrasov": "102",
    "alfred-sisley": "42",
    "amedeo-modigliani": "104",
    "andy-warhol": "52",
    "anthony-van-dyck": "114",
    "antoine-blanchard": "72",
    "arkhip-kuindzhi": "53",
    "aubrey-beardsley": "81",
    "bartolome-esteban-murillo": "61",
    "berthe-morisot": "51",
    "boris-kustodiev": "1",
    "camille-corot": "74",
    "camille-pissarro": "2",
    "canaletto": "128",
    "childe-hassam": "3",
    "claude-monet": "4",
    "dante-gabriel-rossetti": "88",
    "david-burliuk": "73",
    "edgar-degas": "5",
    "edouard-cortes": "26",
    "edouard-manet": "79",
    "edvard-munch": "36",
    "edward-burne-jones": "111",
    "egon-schiele": "32",
    "el-greco": "121",
    "ernst-ludwig-kirchner": "98",
    "eugene-boudin": "6",
    "eugene-delacroix": "127",
    "felix-vallotton": "89",
    "ferdinand-hodler": "60",
    "fernand-leger": "93",
    "fernando-botero": "45",
    "fra-angelico": "38",
    "francisco-goya": "35",
    "frans-hals": "116",
    "gene-davis": "68",
    "georges-braque": "91",
    "georges-seurat": "47",
    "giovanni-boldini": "62",
    "gustav-klimt": "64",
    "gustave-caillebotte": "85",
    "gustave-courbet": "107",
    "gustave-dore": "7",
    "gustave-loiseau": "44",
    "gustave-moreau": "34",
    "hans-holbein-the-younger": "117",
    "hans-memling": "103",
    "henri-de-toulouse-lautrec": "71",
    "henri-fantin-latour": "119",
    "henri-martin": "63",
    "henri-matisse": "37",
    "hieronymus-bosch": "23",
    "ilya-mashkov": "118",
    "ilya-repin": "8",
    "isaac-levitan": "48",
    "ivan-aivazovsky": "9",
    "ivan-bilibin": "76",
    "ivan-kramskoy": "105",
    "ivan-shishkin": "10",
    "jacek-malczewski": "50",
    "jacob-jordaens": "125",
    "james-mcneill-whistler": "123",
    "james-tissot": "55",
    "jan-matejko": "40",
    "joaqu\u00e3\u00adn-sorolla": "49",
    "john-henry-twachtman": "70",
    "john-singer-sargent": "11",
    "joseph-wright": "110",
    "joshua-reynolds": "83",
    "juan-gris": "28",
    "karl-bryullov": "124",
    "katsushika-hokusai": "95",
    "koloman-moser": "112",
    "konstantin-korovin": "75",
    "konstantin-makovsky": "31",
    "konstantin-somov": "94",
    "kuzma-petrov-vodkin": "84",
    "leonardo-da-vinci": "24",
    "lucas-cranach-the-elder": "29",
    "lucian-freud": "86",
    "m.c.-escher": "120",
    "marc-chagall": "12",
    "martiros-saryan": "13",
    "mary-cassatt": "43",
    "maurice-prendergast": "78",
    "maxime-maufra": "39",
    "michelangelo": "87",
    "mikalojus-ciurlionis": "122",
    "mikhail-vrubel": "99",
    "mstislav-dobuzhinsky": "41",
    "nicholas-roerich": "14",
    "niko-pirosmani": "54",
    "nikolay-bogdanov-belsky": "90",
    "odilon-redon": "66",
    "orest-kiprensky": "100",
    "pablo-picasso": "15",
    "paolo-veronese": "82",
    "paul-cezanne": "16",
    "paul-gauguin": "30",
    "peter-paul-rubens": "80",
    "pierre-auguste-renoir": "17",
    "pierre-bonnard": "59",
    "pietro-perugino": "58",
    "pyotr-konchalovsky": "18",
    "raoul-dufy": "115",
    "raphael": "69",
    "raphael-kirchner": "19",
    "rembrandt": "20",
    "salvador-dali": "21",
    "sam-francis": "27",
    "sir-lawrence-alma-tadema": "96",
    "theo-van-rysselberghe": "109",
    "thomas-eakins": "33",
    "thomas-gainsborough": "126",
    "tintoretto": "67",
    "titian": "77",
    "utagawa-kuniyoshi": "106",
    "valentin-serov": "57",
    "vasily-perov": "65",
    "vasily-polenov": "56",
    "vasily-surikov": "92",
    "vasily-vereshchagin": "97",
    "viktor-vasnetsov": "113",
    "vincent-van-gogh": "22",
    "william-merritt-chase": "101",
    "william-turner": "108",
    "zinaida-serebriakova": "46"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.22.1"
}
